/*
题目描述：  剑指 Offer 60. n个骰子的点数
难度：  中等
编写日期：   2022 年 2 月 27 日 晚 17：00
重写日期：   2022 年 2 月 28 日 早 10：00
*/
/*题目：  

	把n个骰子扔在地上，所有骰子朝上一面的点数之和为s。输入n，打印出s的所有可能的值出现的概率。

    你需要用一个浮点数数组返回答案，其中第 i 个元素代表这 n 个骰子所能掷出的点数集合中第 i 小的那个的概率。

    示例 1:

    输入: 1
    输出: [0.16667,0.16667,0.16667,0.16667,0.16667,0.16667]
    示例 2:

    输入: 2
    输出: [0.02778,0.05556,0.08333,0.11111,0.13889,0.16667,0.13889,0.11111,0.08333,0.05556,0.02778]

    限制：

    1 <= n <= 11

*/
/*  

*/
package main

import (
    "fmt"
)

func main() {
	res := nthUglyNumber(1690)
    fmt.Println( res )
}

// 默认代码模版
func dicesProbability(n int) []float64 {
    if n == 1 {
        return []float64{1.0/6, 1.0/6, 1.0/6, 1.0/6, 1.0/6, 1.0/6}
    }
    res := make([]float64, n*5+1)
    if n > 1 {
        temp := dicesProbability(n-1)
        for i := 0; i < len(temp); i++ {
            temp[i] /= 6.0
        }
        for i := 0; i < 6; i++ {
            for j := 0; j < len(temp); j++ {
                res[i+j] = res[i+j] + temp[j]
            }
        }
    }
    return res
}